pulmanturbd/certification4/ConfirmBookingRQ.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:conf="http://services.rccl.com/Interfaces/ConfirmBooking" xmlns:alp="http://www.opentravel.org/OTA/2003/05/alpha">
<soap:Body>
    <conf:confirmBooking>
    <OTA_CruiseBookRQ TransactionActionCode="Commit" Version="1.0" SequenceNmbr="1" TimeStamp="2008-12-30T18:30:42.720+05:30" RetransmissionIndicator="false" Target="Test" xmlns="http://www.opentravel.org/OTA/2003/05/alpha">
    <POS>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENCY1" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENCY2" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
        <Source TerminalID="12502LDJW6" ISOCurrency="USD">
            <RequestorID ID="313917" ID_Context="AGENT1" Type="5"/>
            <BookingChannel Type="7">
            <CompanyName CompanyShortName="PULLMANTUR"/>
            </BookingChannel>
        </Source>
    </POS>
    <AgentInfo Contact="CMOTEST12" ContactID="CMOtest_MI12"/>
    <SailingInfo>
        <SelectedSailing Start="2021-02-14">
            <CruiseLine ShipCode="HR"/>
        </SelectedSailing>
        <InclusivePackageOption CruisePackageCode="HRPO0714"/>
        <SelectedCategory PricedCategoryCode="L" BerthedCategoryCode="L" FareCode="BESTRATE" DeckNumber="4" DeckName="CUBIERTA 4">
            <!--Optional:-->
            <alp:CabinAttributes>
                <!--1 to 99 repetitions:-->
                <alp:CabinAttribute CabinAttributeCode="86"/>
            </alp:CabinAttributes>
            <SelectedCabin Status="39" CabinNumber="4141" MaxOccupancy="2"/>
        </SelectedCategory>
    </SailingInfo>
    <ReservationInfo>
        <ReservationID LastModifyDateTime="2020-05-08T17:33:07.000Z" ID="0000000" Type="14"/>
        <GuestDetails>
            <GuestDetail>
                <SelectedFareCode FareCode="BESTRATE"/>
                <ContactInfo Nationality="ES" Age="30" BirthDate="1990-05-01" ContactType="CNT" Code="10">
                <PersonName>
                    <GivenName>David</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    <NameTitle>MR</NameTitle>
                </PersonName>
                </ContactInfo>
                <ContactInfo ContactType="ALT">
                    <PersonName>
                    <GivenName>David</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    </PersonName>
                    <Address>
                    <AddressLine>MAhonia 2</AddressLine>
                    <CityName>Madrid</CityName>
                    <PostalCode>28043</PostalCode>
                    <CountryName Code="ES"/>
                    </Address>
                    <Email>davizch2004@gmail.com</Email>
                </ContactInfo>
                <ContactInfo ContactType="EMG">
                    <PersonName>
                    <GivenName>David</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    </PersonName>
                    <Telephone PhoneNumber="9871236540"/>
                </ContactInfo>
                <GuestTransportation Status="36" Mode="29">
                    <GatewayCity LocationCode="C/O"/>
                </GuestTransportation>
                <SelectedDining Status="36" Sitting="M"/>
                <CruiseDocument DocumentLanguage="ES"/>
            </GuestDetail>
            <GuestDetail>
                <SelectedFareCode FareCode="BESTRATE"/>
                <ContactInfo Nationality="ES" Age="1" BirthDate="2019-05-01" ContactType="CNT" Code="8">
                <PersonName>
                    <GivenName>Maria</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    <NameTitle>MR</NameTitle>
                </PersonName>
                </ContactInfo>
                <ContactInfo ContactType="ALT">
                    <PersonName>
                    <GivenName>David</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    </PersonName>
                    <Address>
                    <AddressLine>MAhonia 2</AddressLine>
                    <CityName>Madrid</CityName>
                    <PostalCode>28043</PostalCode>
                    <CountryName Code="ES"/>
                    </Address>
                    <Email>davizch2004@gmail.com</Email>
                </ContactInfo>
                <ContactInfo ContactType="EMG">
                    <PersonName>
                    <GivenName>David</GivenName>
                    <Surname>Sanchez LLorente</Surname>
                    </PersonName>
                    <Telephone PhoneNumber="9871236540"/>
                </ContactInfo>
                <GuestTransportation Status="36" Mode="29">
                    <GatewayCity LocationCode="C/O"/>
                </GuestTransportation>
                <SelectedDining Status="36" Sitting="M"/>
                <CruiseDocument DocumentLanguage="ES"/>
            </GuestDetail>
        </GuestDetails>
    </ReservationInfo>
    </OTA_CruiseBookRQ>
    </conf:confirmBooking>
</soap:Body>
</soap:Envelope>